## Production: system_status_static_site
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 6 to add, 2 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                                    NAME                                                                    |
|----------|--------------------------------------------------------------------------------------------------------------------------------------------|
| add      | `module.system_status_static_site.aws_acm_certificate_validation.cloudfront[0]`                                                            |
|          | `module.system_status_static_site.aws_cloudfront_distribution.simple_static_website`                                                       |
|          | `module.system_status_static_site.aws_route53_record.cloudfront_alias`                                                                     |
|          | `module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation[&quot;*.status.notification.canada.ca&quot;]`                 |
|          | `module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation[&quot;status.notification.canada.ca&quot;]`                   |
| delete   | `module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation[&quot;*.status.production.notification.cdssandbox.xyz&quot;]` |
|          | `module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation[&quot;status.production.notification.cdssandbox.xyz&quot;]`   |
| update   | `module.system_status_static_site.aws_cloudfront_origin_access_identity.simple_static_website`                                             |
|          | `module.system_status_static_site.aws_s3_bucket_policy.oai_policy`                                                                         |
| recreate | `module.system_status_static_site.aws_acm_certificate.cloudfront[0]`                                                                       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.system_status_static_site.data.aws_iam_policy_document.s3_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "s3_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::notification-canada-ca-production-system-status/*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2QQJ3TLUOXITR",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.system_status_static_site.aws_acm_certificate.cloudfront[0] must be replaced
+/- resource "aws_acm_certificate" "cloudfront" {
      ~ arn                       = "arn:aws:acm:us-east-1:296255494825:certificate/4a7401aa-35fd-4de2-a0ea-325f2f628bc0" -> (known after apply)
      ~ domain_name               = "status.production.notification.cdssandbox.xyz" -> "status.notification.canada.ca" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "*.status.production.notification.cdssandbox.xyz"
              - resource_record_name  = "_49171ee15659ac576fca001d11c04900.status.production.notification.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_9724023edb9279295cbd0982fbcb8463.mhbtsbpdnt.acm-validations.aws."
            },
          - {
              - domain_name           = "status.production.notification.cdssandbox.xyz"
              - resource_record_name  = "_49171ee15659ac576fca001d11c04900.status.production.notification.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_9724023edb9279295cbd0982fbcb8463.mhbtsbpdnt.acm-validations.aws."
            },
          + {
              + domain_name           = "*.status.notification.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "status.notification.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-east-1:296255494825:certificate/4a7401aa-35fd-4de2-a0ea-325f2f628bc0" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "INELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "PENDING_VALIDATION" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          - "*.status.production.notification.cdssandbox.xyz",
          - "status.production.notification.cdssandbox.xyz",
          + "*.status.notification.canada.ca",
          + "status.notification.canada.ca",
        ]
        tags                      = {
            "CostCentre" = "notification-canada-ca-production"
            "Terraform"  = "true"
        }
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (2 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.system_status_static_site.aws_acm_certificate_validation.cloudfront[0] will be created
  + resource "aws_acm_certificate_validation" "cloudfront" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.system_status_static_site.aws_cloudfront_distribution.simple_static_website will be created
  + resource "aws_cloudfront_distribution" "simple_static_website" {
      + aliases                         = [
          + "status.notification.canada.ca",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "simple_static_website"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "notification-canada-ca-production-system-status.s3.ca-central-1.amazonaws.com"
          + origin_id           = "simple_static_website"

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E2QQJ3TLUOXITR"
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.system_status_static_site.aws_cloudfront_origin_access_identity.simple_static_website will be updated in-place
  ~ resource "aws_cloudfront_origin_access_identity" "simple_static_website" {
      ~ comment                         = "Allow CloudFront to reach the S3 bucket for domain status.production.notification.cdssandbox.xyz" -> "Allow CloudFront to reach the S3 bucket for domain status.notification.canada.ca"
        id                              = "E2QQJ3TLUOXITR"
        # (5 unchanged attributes hidden)
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_alias will be created
  + resource "aws_route53_record" "cloudfront_alias" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "status.notification.canada.ca"
      + type            = "A"
      + zone_id         = "/hostedzone/Z07701011ICTZVSX5P68J"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation["*.status.notification.canada.ca"] will be created
  + resource "aws_route53_record" "cloudfront_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "/hostedzone/Z07701011ICTZVSX5P68J"
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation["*.status.production.notification.cdssandbox.xyz"] will be destroyed
  # (because key ["*.status.production.notification.cdssandbox.xyz"] is not in for_each map)
  - resource "aws_route53_record" "cloudfront_certificate_validation" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_49171ee15659ac576fca001d11c04900.status.production.notification.cdssandbox.xyz.notification.canada.ca" -> null
      - id                               = "Z07701011ICTZVSX5P68J__49171ee15659ac576fca001d11c04900.status.production.notification.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_49171ee15659ac576fca001d11c04900.status.production.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "_9724023edb9279295cbd0982fbcb8463.mhbtsbpdnt.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z07701011ICTZVSX5P68J" -> null
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation["status.notification.canada.ca"] will be created
  + resource "aws_route53_record" "cloudfront_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "/hostedzone/Z07701011ICTZVSX5P68J"
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation["status.production.notification.cdssandbox.xyz"] will be destroyed
  # (because key ["status.production.notification.cdssandbox.xyz"] is not in for_each map)
  - resource "aws_route53_record" "cloudfront_certificate_validation" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_49171ee15659ac576fca001d11c04900.status.production.notification.cdssandbox.xyz.notification.canada.ca" -> null
      - id                               = "Z07701011ICTZVSX5P68J__49171ee15659ac576fca001d11c04900.status.production.notification.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_49171ee15659ac576fca001d11c04900.status.production.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "_9724023edb9279295cbd0982fbcb8463.mhbtsbpdnt.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z07701011ICTZVSX5P68J" -> null
    }

  # module.system_status_static_site.aws_s3_bucket_policy.oai_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "oai_policy" {
        id     = "notification-canada-ca-production-system-status"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2QQJ3TLUOXITR"
                        }
                      - Resource  = "arn:aws:s3:::notification-canada-ca-production-system-status/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 6 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

